backend/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    categories = Category.all